Terraform Plan output for services/base:

  # aws_ssm_parameter.staticsite_sensitive["/bfd/test/static-site/sensitive/tls_certificate_body"] will be created
  + resource "aws_ssm_parameter" "staticsite_sensitive" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "arn:aws:kms:us-east-1:577373831711:key/mrk-15fa4e6371924bffa9764c218f7a767a"
      + name           = "/bfd/test/static-site/sensitive/tls_certificate_body"
      + overwrite      = true
      + tags_all       = {
          + "Environment"    = "test"
          + "Terraform"      = "true"
          + "application"    = "bfd"
          + "business"       = "oeda"
          + "stack"          = "test"
          + "tf_module_root" = "ops/terraform/services/base"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.staticsite_sensitive["/bfd/test/static-site/sensitive/tls_private_key_body"] will be created
  + resource "aws_ssm_parameter" "staticsite_sensitive" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "arn:aws:kms:us-east-1:577373831711:key/mrk-15fa4e6371924bffa9764c218f7a767a"
      + name           = "/bfd/test/static-site/sensitive/tls_private_key_body"
      + overwrite      = true
      + tags_all       = {
          + "Environment"    = "test"
          + "Terraform"      = "true"
          + "application"    = "bfd"
          + "business"       = "oeda"
          + "stack"          = "test"
          + "tf_module_root" = "ops/terraform/services/base"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
